RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_structure.h
/** Defines BIST IO Configuration */
typedef enum
{
    CY_CAPSENSE_BIST_IO_UNDEFINED_E        = 0x00u,             /**< The undefined state. Pins are disconnected from AMuxBus */
    CY_CAPSENSE_BIST_IO_STRONG_E           = 0x01u,             /**< The drive mode is set to Strong in off - Low.
                                                                   * The HSIOM is set to GPIO */
    CY_CAPSENSE_BIST_IO_HIGHZA_E           = 0x02u,             /**< The drive mode is set to High-Z.
                                                                   * The HSIOM is set to GPIO */
    CY_CAPSENSE_BIST_IO_SENSE_E            = 0x03u,             /**< The drive mode is set to High-Z/Strong in off (depending on the device platform).
                                                                   * The HSIOM is set to CSD sense connection. */
    CY_CAPSENSE_BIST_IO_SHIELD_E           = 0x04u,             /**< The drive mode is set to High-Z/Strong in off (depending on the device platform).
                                                                   * The HSIOM is set to CSD shield connection. */
    CY_CAPSENSE_BIST_IO_STRONG_HIGH_E      = 0x05u,             /**< The drive mode is set to Strong in off - High.
                                                                   * The HSIOM is set to GPIO */
} cy_en_capsense_bist_io_state_t;


/** Defines BIST result statuses */
typedef enum
{
    CY_CAPSENSE_BIST_SUCCESS_E             = 0x00u,             /**< The success test status */
    CY_CAPSENSE_BIST_BAD_PARAM_E           = 0x01u,             /**< The bad input parameters test status */
    CY_CAPSENSE_BIST_HW_BUSY_E             = 0x02u,             /**< The CSD HW block is busy by previous operation */
    CY_CAPSENSE_BIST_LOW_LIMIT_E           = 0x03u,             /**< The status for a low limit reached during the test */
    CY_CAPSENSE_BIST_HIGH_LIMIT_E          = 0x04u,             /**< The status for a high limit reached during the test */
    CY_CAPSENSE_BIST_ERROR_E               = 0x05u,             /**< The status for an error occurred during the test.
                                                                     The test is not completed */
    CY_CAPSENSE_BIST_FEATURE_DISABLED_E    = 0x06u,             /**< The BIST feature is disabled. */
    CY_CAPSENSE_BIST_TIMEOUT_E             = 0x07u,             /**< The status for a timeout occurred during the test */
    CY_CAPSENSE_BIST_BAD_CONFIG_E          = 0x08u,             /**< The bad configuration parameters test status */
    CY_CAPSENSE_BIST_FAIL_E                = 0x0Fu,             /**< The failed test status */
} cy_en_capsense_bist_status_t;


/** Defines the raw count accumulation mode for MSC HW block */
typedef enum
{
    CY_CAPSENSE_MSC_RAW_SATURATE_E         = 0x00u,             /**< In this scenario, RAW_COUNT is clamped at 0xFFFF and RESULT_FIFO_RD.OVERFLOW is set. */
    CY_CAPSENSE_MSC_RAW_OVERFLOW_E         = 0x01u,             /**< In this scenario, RAW_COUNT rolls over and RESULT_FIFO_RD.OVERFLOW is set. This mode allows more sensitive tuning if measuring baseline capacitance */
} cy_en_capsense_msc_raw_mode_t;

/** \} */


/*******************************************************************************
* CAPSENSE&trade; Data Structures
*******************************************************************************/

/******************************************************************************/
/** \addtogroup group_capsense_structures *//** \{ */
/******************************************************************************/

/** Unified return status of CAPSENSE&trade; operation:
 * * CY_CAPSENSE_STATUS_SUCCESS
 * * CY_CAPSENSE_STATUS_BAD_PARAM
 * * CY_CAPSENSE_STATUS_BAD_DATA
 * * CY_CAPSENSE_STATUS_TIMEOUT
 * * CY_CAPSENSE_STATUS_INVALID_STATE
 * * CY_CAPSENSE_STATUS_BAD_CONFIG
 * * CY_CAPSENSE_STATUS_CONFIG_OVERFLOW
 * * CY_CAPSENSE_STATUS_HW_BUSY
 * * CY_CAPSENSE_STATUS_UNKNOWN
 */
typedef uint32_t cy_capsense_status_t;

/** Unified return state of CAPSENSE&trade; Middleware:
 *
 * * CY_CAPSENSE_MW_STATE_BIST_MASK               - The BIST is in progress.
 *                                                  The next scan frame cannot be started.
 * * CY_CAPSENSE_MW_STATE_CALIBRATION_MASK        - The auto-calibration is in progress.
 *                                                  The next scan frame cannot be started.
 * * CY_CAPSENSE_MW_STATE_SMARTSENSE_MASK         - The smart sensing algorithm is
 *                                                  in progress.
 *                                                  The next scan frame cannot be started.
 * * CY_CAPSENSE_MW_STATE_INITIALIZATION_MASK     - Middleware initialization is
 *                                                  in progress and a next scan frame
 *                                                  can be initiated.
 * * CY_CAPSENSE_MW_STATE_SCAN_SLOT_MASK[x]       - The set [x] number of the result
 *                                                  means that the previously initiated
 *                                                  scan for the [x] slot is completed
 *                                                  or in progress. In CS-DMA mode, this
 *                                                  field is set only for the first
 *                                                  scanned slot.
 */
typedef uint32_t cy_capsense_mw_state_t;

/** Sensor context structure */
typedef struct
{
    uint16_t raw;                                               /**< Sensor raw count */
    uint16_t bsln;                                              /**< Sensor baseline */
    uint16_t diff;                                              /**< Sensor difference count */
    uint8_t status;                                             /**< Sensor status, contains masks:
                                                                   * * bit[0] - Sensor Touched (CY_CAPSENSE_SNS_TOUCH_STATUS_MASK)
                                                                   * * bit[1] - Proximity Sensor Touched  (CY_CAPSENSE_SNS_PROX_STATUS_MASK)
                                                                   * * bit[2] - Overflow during scanning (CY_CAPSENSE_SNS_OVERFLOW_MASK) */
    uint8_t negBslnRstCnt;                                      /**< Negative baseline reset counter */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint8_t idacComp;                                       /**< Compensation IDAC of CSD or IDAC in CSX
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
    #endif
    uint8_t bslnExt;                                            /**< Sensor baseline fractional */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        uint8_t cdacComp;                                       /**< Compensation CDAC
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    #endif
} cy_stc_capsense_sensor_context_t;

/** CSX Touchpad touch tracking history */
typedef struct
{
    uint32_t velocity;                                          /**< The square of the "speed" (maximum distance change per refresh interval) threshold
                                                                   * distinguishing a fast finger movement from separate finger touches
                                                                   * (in [pixels/refresh interval]).
                                                                   * Squared speeds exceeding this value indicate separate finger touches.
                                                                   * Squared speeds below this value indicate fast single finger movement. */
    cy_stc_capsense_position_t oldPeak[CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS];
                                                                /**< Touch Positions */
    uint8_t oldPeakNumber;                                      /**< Number of detected peaks */
    uint8_t oldActiveIdsMask;                                   /**< Mask of used IDs */
} cy_stc_capsense_csx_touch_history_t;

/** Internal CSX Touchpad buffer structure for CSX for Touchpads' processing */
typedef struct
{
    int32_t distanceMap[CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS * CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS];
                                                                /**< Buffer for distance map data */
    int32_t colMap[CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS];         /**< Buffer for column map data */
    int32_t rowMap[CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS];         /**< Buffer for row map data */
    int32_t minsMap[CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS];        /**< Buffer for minimums map data */
    cy_stc_capsense_position_t newPeak[CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS];
                                                                /**< Touch Positions */
    int8_t fingerPosIndexMap[CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS + 3u];
                                                                /**< Buffer for index map data */
    int8_t linksMap[CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS];        /**< Buffer for linked map data */
    int8_t visitedMap[CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS];      /**< Buffer for visited map data */
    int8_t markIndicesMap[CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS];  /**< Buffer for mark map data */
    uint8_t newPeakNumber;                                      /**< Number of detected peaks */
    uint8_t newActiveIdsMask;                                   /**< Mask of used IDs */
} cy_stc_capsense_csx_touch_buffer_t;

/** Widget context structure */
typedef struct
{
    uint16_t fingerCap;                                         /**< Widget finger capacitance parameter used for the CSD
                                                                   * widgets only when smart sensing algorithm is enabled */
    uint16_t sigPFC;                                            /**< The 75% of signal per user-defined finger capacitance */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint16_t resolution;                                    /**< Provides scan resolution for the CSD Widgets.
                                                                 * Provides number of sub-conversions for the CSX Widgets
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    #endif
    uint16_t maxRawCount;                                       /**< Calculated maximum raw count of widget */
    uint16_t maxRawCountRow;                                    /**< Calculated row maximum raw count of widget */
    uint16_t fingerTh;                                          /**< Widget Finger Threshold */
    uint16_t proxTh;                                            /**< Widget Proximity Threshold */
    uint16_t lowBslnRst;                                        /**< The widget low baseline reset count. Specifies the number
                                                                   * of samples the sensor signal must be below the Negative
                                                                   * Noise Threshold \ref nNoiseTh to trigger a baseline reset */
    uint16_t snsClk;                                            /**< Sense Clock Divider. For the Matrix Buttons and Touchpad widgets
                                                                   * specifies the column sense clock divider */
    uint16_t rowSnsClk;                                         /**< Row Sense Clock Divider for the Matrix Buttons and Touchpad widgets */
    uint16_t gestureDetected;                                   /**< Mask of detected gestures */
    uint16_t gestureDirection;                                  /**< Mask of directions of detected gestures */
    int16_t xDelta;                                             /**< The filtered by Ballistic Multiplier X-displacement */
    int16_t yDelta;                                             /**< The filtered by Ballistic Multiplier Y-displacement */
    uint16_t noiseTh;                                           /**< Widget Noise Threshold */
    uint16_t nNoiseTh;                                          /**< Widget Negative Noise Threshold */
    uint16_t hysteresis;                                        /**< Widget Hysteresis for the signal crossing finger threshold */
    uint8_t onDebounce;                                         /**< Widget Debounce for the signal above the finger threshold 1 to 255.
                                                                   * * 1 - touch reported immediately as soon as detected
                                                                   * * 2 - touch reported on the second consecutive detection
                                                                   * * 3 - touch reported on the third consecutive detection */
    uint8_t snsClkSource;                                       /**< Widget clock source:
                                                                   * * bit[7] - Indicates auto mode of clock source selection
                                                                   * * bit[0:6] - Clock source:
                                                                   *   * 0 - Direct (CY_CAPSENSE_CLK_SOURCE_DIRECT)
                                                                   *   * 1 - SSC6 (CY_CAPSENSE_CLK_SOURCE_SSC6)
                                                                   *   * 2 - SSC7 (CY_CAPSENSE_CLK_SOURCE_SSC7)
                                                                   *   * 3 - SSC9 (CY_CAPSENSE_CLK_SOURCE_SSC9)
                                                                   *   * 4 - SSC10 (CY_CAPSENSE_CLK_SOURCE_SSC10)
                                                                   *   * 5 - PRS8 (CY_CAPSENSE_CLK_SOURCE_PRS8)
                                                                   *   * 6 - PRS12 (CY_CAPSENSE_CLK_SOURCE_PRS12) */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint8_t idacMod[CY_CAPSENSE_MAX_SUPPORTED_FREQ_NUM];         /**< Sets the current of the modulation IDAC for the CSD widgets.
                                                                * For the CSD Touchpad and Matrix Button widgets sets the current of the
                                                                * modulation IDAC for the column sensors. Not used for the CSX widgets.
                                                                * \note This field is available only for the fourth-generation CAPSENSE&trade;.*/
        uint8_t idacGainIndex;                                  /**< Index of IDAC gain in table \ref cy_stc_capsense_idac_gain_table_t
                                                                * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                *  */
        uint8_t rowIdacMod[CY_CAPSENSE_MAX_SUPPORTED_FREQ_NUM];      /**< Sets the current of the modulation IDAC for the row sensors
                                                                * for the CSD Touchpad and Matrix Button widgets. Not used for the CSX widgets.
                                                                * \note This field is available only for the fourth-generation CAPSENSE&trade;.*/
    #endif
    uint8_t bslnCoeff;                                          /**< Baseline IIR filter coefficient. Lower value leads to higher filtering. */
    uint8_t status;                                             /**< Contains masks:
                                                                   * * bit[0] - Widget Active (CY_CAPSENSE_WD_ACTIVE_MASK)
                                                                   * * bit[1] - Widget Disabled (CY_CAPSENSE_WD_DISABLE_MASK)
                                                                   * * bit[2] - Widget Working (CY_CAPSENSE_WD_WORKING_MASK) */
    cy_stc_capsense_touch_t wdTouch;                            /**< Widget touch structure used for Matrix Buttons, Sliders, and Touchpads */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        uint16_t numSubConversions;                             /**< Number of sub-conversions in a scan
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t cdacRef;                                        /**< Sets the capacitance of the reference CDAC
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t rowCdacRef;                                     /**< Sets the capacitance of the reference CDAC for CSD
                                                                 * Touchpad and CSD Matrix buttons widgets
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t cicRate;                                        /**< Sets decimation rate when CIC2 is enabled
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t cdacDitherEn;                                   /**< Enabled CDAC dithering
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t cdacDitherValue;                                /**< CDAC dither value in percentage
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t coarseInitBypassEn;                             /**< Skip Cmod coarse initialization sensors scan within widget
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint16_t cdacCompDivider;                               /**< Number of time DAC switched in sense clock period
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t lfsrBits;                                       /**< Defines the number of LSB bits to use by the LSFR unit to achieve
                                                                 *   the desired clock dithering variation.
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    #endif

} cy_stc_capsense_widget_context_t;

