RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_structure.h
    cy_stc_capsense_ballistic_config_t ballisticConfig;         /**< The configuration data for position ballistic filter. */
    cy_stc_capsense_ballistic_context_t * ptrBallisticContext;  /**< Pointer to Ballistic filter context structure */

    cy_stc_capsense_adaptive_filter_config_t aiirConfig;        /**< The configuration of position adaptive filter. */
    cy_stc_capsense_advanced_touchpad_config_t advConfig;       /**< The configuration of CSD advanced touchpad */

    uint32_t posFilterConfig;                                   /**< Position filters configuration */
    uint16_t rawFilterConfig;                                   /**< Raw count filters configuration */

    uint8_t senseMethod;                                        /**< Specifies the widget sensing method:
                                                                    * * 0 - UNDEFINED   (CY_CAPSENSE_UNDEFINED_GROUP)
                                                                    * * 1 - CSD         (CY_CAPSENSE_CSD_GROUP)
                                                                    * * 2 - CSX         (CY_CAPSENSE_CSX_GROUP) */
    uint8_t wdType;                                             /**< Specifies the widget type */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        cy_stc_capsense_mptx_table_t * ptrMptxTable;            /**< Pointer to the multi-phase TX vector and de-convolution coefficients
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint16_t firstSlotId;                                   /**< The slot ID in the widget to start scan from
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint16_t numSlots;                                      /**< The number of slots in the widget
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t numChopCycles;                                  /**< Defines number of chopping cycles. One cycle means the feature is disabled
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t mptxOrder;                                      /**< Multi-phase TX order
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t lfsrDitherLimit;                                /**< Max dither in percentage. The input parameter for the LFSR range auto-selection algorithm
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t snsClkSourceAutoSelMode;                        /**< Defines set of rules that are used by clock source auto-selection algorithm
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t mfsConfig;                                      /**< Multi-frequency Scan (MFS) widget configuration.
                                                                 **  Contains masks:
                                                                 * * bit[0:3] - Number of MFS Channels (CY_CAPSENSE_MFS_FREQ_CHANNELS_NUM_MASK).
                                                                 * * bit[4]   - MFS Configuration (CY_CAPSENSE_MFS_EN_MASK):
                                                                 *   * 0 - MFS Disabled.
                                                                 *   * 1 - MFS Enabled (Base or Frequency channel widget).
                                                                 * * bit[5:6]   - Widget attribute (CY_CAPSENSE_MFS_WIDGET_FREQ_ALL_CH_MASK):
                                                                 *   * 0 - Base widget
                                                                 *   * 1 - Frequency channel 1 widget (CY_CAPSENSE_MFS_WIDGET_FREQ_CH_1_MASK)
                                                                 *   * 2 - Frequency channel 2 widget (CY_CAPSENSE_MFS_WIDGET_FREQ_CH_2_MASK)
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    #endif
} cy_stc_capsense_widget_config_t;

#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
/** Declares the IDAC gain table
 * \note This structure is available only for the fourth-generation CAPSENSE&trade;.
*/
typedef struct
{
    uint32_t gainReg;                                           /**< Register value of IDAC gain */
    uint32_t gainValue;                                         /**< Absolute gain value in pA */
} cy_stc_capsense_idac_gain_table_t;
#endif

#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
/** Declares the scan order of widget and sensor
 * \note This structure is available only for the fifth-generation CAPSENSE&trade;.
 */
typedef struct
{
    uint16_t wdId;                                              /**< Specifies the widget ID for the current scan slot */
    uint16_t snsId;                                             /**< Specifies the sensor ID for the current scan slot */
} cy_stc_capsense_scan_slot_t;
#endif

#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
/** Declares MSC channel (HW block) configuration
 * \note This structure is available only for the fifth-generation CAPSENSE&trade;.
 */
typedef struct
{
    MSC_Type * ptrMscBase;                                  /**< Pointer to the MSC HW block register */
    cy_stc_msc_context_t * ptrMscContext;                   /**< Pointer to the MSC driver context */

    GPIO_PRT_Type * portCmod1;                              /**< The pointer to the Cmod1 pin base port register */
    uint8_t pinCmod1;                                       /**< The Cmod1 pin position (bit number) in the port */

