RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_structure.h
    GPIO_PRT_Type * portCmod2;                              /**< The pointer to the Cmod2 pin base port register */
    uint8_t pinCmod2;                                       /**< The Cmod2 pin position (bit number) in the port */

    uint8_t dmaWrChIndex;                                   /**< Specifies the DMA Write channel index */
    uint8_t dmaChainWrChIndex;                              /**< Specifies the DMA Chain Write channel index */
    uint8_t dmaRdChIndex;                                   /**< Specifies the DMA Read channel index */
    uint8_t dmaChainRdChIndex;                              /**< Specifies the DMA Chain Read channel index */
} cy_stc_msc_channel_config_t;
#endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */


/** Common configuration structure */
typedef struct
{
    uint32_t cpuClkHz;                                          /**< CPU clock in Hz */
    uint32_t periClkHz;                                         /**< Peripheral clock in Hz */
    uint16_t vdda;                                              /**< VDDA in mV */
    uint16_t numPin;                                            /**< Total number of IOs. */
    uint16_t numSns;                                            /**< The total number of sensors. It is equal to the number of objects with raw count.
                                                                   * * For CSD widgets: WD_NUM_ROWS + WD_NUM_COLS
                                                                   * * For CSX widgets: WD_NUM_ROWS * WD_NUM_COLS */
    uint8_t numWd;                                              /**< Total number of widgets */

    uint8_t csdEn;                                              /**< CSD sensing method enabled, at least one CSD widget is configured */
    uint8_t csxEn;                                              /**< CSX sensing method enabled, at least one CSX widget is configured */
    uint8_t positionFilterEn;                                   /**< Position filtering enabled */
    uint8_t bistEn;                                             /**< Built-in Self-test (BIST) enabled */

    uint8_t periDividerType;                                    /**< Peripheral clock type (8- or 16-bit type) */
    uint8_t periDividerIndex;                                   /**< Peripheral divider index */
    uint8_t analogWakeupDelay;                                  /**< Time needed to establish correct operation of the CSD HW block after power up or System Deep Sleep. */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint8_t ssIrefSource;                                   /**< Iref source
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  * */
        uint8_t ssVrefSource;                                   /**< Vref source
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
    #endif
    uint16_t proxTouchCoeff;                                    /**< Proximity touch coefficient in percentage used in smart sensing algorithm */
    uint8_t swSensorAutoResetEn;                                /**< Sensor auto reset enabled */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint8_t portCmodPadNum;                                 /**< Number of port of dedicated Cmod pad
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t pinCmodPad;                                     /**< Position of the dedicated Cmod pad in the port
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t portCshPadNum;                                  /**< Number of port of dedicated Csh pad
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t pinCshPad;                                      /**< Position of the dedicated Csh pad in the port
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t portShieldPadNum;                               /**< Number of port of dedicated Shield pad
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t pinShieldPad;                                   /**< Position of the dedicated Shield pad in the port
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t portVrefExtPadNum;                              /**< Number of port of dedicated VrefExt pad
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t pinVrefExtPad;                                  /**< Position of the dedicated VrefExt pad in the port
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t portCmodNum;                                    /**< Number of port of Cmod pin
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        cy_stc_capsense_idac_gain_table_t idacGainTable[CY_CAPSENSE_IDAC_GAIN_NUMBER];
                                                                /**< Table with the supported IDAC gains and corresponding register values
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        CSD_Type * ptrCsdBase;                                  /**< Pointer to the CSD HW block register
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        cy_stc_csd_context_t * ptrCsdContext;                   /**< Pointer to the CSD driver context
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        GPIO_PRT_Type * portCmod;                               /**< Pointer to the base port register of the Cmod pin
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        GPIO_PRT_Type * portCsh;                                /**< Pointer to the base port register of the Csh pin
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        GPIO_PRT_Type * portCintA;                              /**< Pointer to the base port register of the CintA pin
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        GPIO_PRT_Type * portCintB;                              /**< Pointer to the base port register of the CintB pin
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t pinCmod;                                        /**< Position of the Cmod pin in the port
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t portCshNum;                                     /**< Number of port of Csh pin
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t pinCsh;                                         /**< Position of the Csh pin in the port
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t pinCintA;                                       /**< Position of the CintA pin in the port
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t pinCintB;                                       /**< Position of the CintB pin in the port
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csdShieldEn;                                    /**< Shield enabled
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
    #endif
    uint8_t csdInactiveSnsConnection;                           /**< Inactive sensor connection for CSD scan:
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_SHIELD
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_GROUND */
    uint8_t csxInactiveSnsConnection;                           /**< Inactive sensor connection for CSD scan:
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_GROUND */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint8_t csdShieldDelay;                                 /**< Shield signal delay
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint16_t csdVref;                                       /**< Vref for CSD method
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
    #endif
    uint16_t csdRConst;                                         /**< Sensor resistance in series used by smart sensing algorithm */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint8_t csdCTankShieldEn;                               /**< Csh enabled
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
    #endif
    uint8_t csdShieldNumPin;                                    /**< Number of shield IOs */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint8_t csdShieldSwRes;                                 /**< Shield switch resistance
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csdInitSwRes;                                   /**< Switch resistance at coarse initialization
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csdChargeTransfer;                              /**< IDAC sensing configuration
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
    #endif
    uint8_t csdRawTarget;                                       /**< Raw count target in percentage for CSD calibration */
    uint8_t csdAutotuneEn;                                      /**< smart sensing algorithm enabled */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint8_t csdIdacAutocalEn;                               /**< CSD IDAC calibration enabled
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csdIdacGainInitIndex;                           /**< IDAC gain index per \ref idacGainTable
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csdIdacAutoGainEn;                              /**< IDAC gain auto-calibration enabled
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
    #endif
        uint8_t csdCalibrationError;                            /**< Acceptable calibration error */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint8_t csdIdacMin;                                     /**< Min acceptable IDAC value in CSD calibration
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csdIdacCompEn;                                  /**< Compensation IDAC enabled
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csdFineInitTime;                                /**< Number of dummy SnsClk periods at fine initialization
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csdIdacRowColAlignEn;                           /**< Row-Column alignment enabled. It adjusts modulator IDAC for rows
                                                                  * and for columns to achieve the similar sensitivity.
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csdMfsDividerOffsetF1;                          /**< Frequency divider offset for channel 1. This value is added to
                                                                  * base (channel 0) SnsClk divider to form channel 1 frequency
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csdMfsDividerOffsetF2;                          /**< Frequency divider offset for channel 2. This value is added to
                                                                  * base (channel 0) SnsClk divider to form channel 2 frequency
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
    #endif
    uint8_t csxRawTarget;                                       /**< Raw count target in percentage for CSX calibration */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint8_t csxIdacGainInitIndex;                           /**< IDAC gain for CSX method
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csxRefGain;                                     /**< Refgen gain for CSX method
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csxIdacAutocalEn;                               /**< CSX IDAC calibration enabled
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
    #endif
    uint8_t csxCalibrationError;                                /**< Acceptable calibration error */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint8_t csxFineInitTime;                                /**< Number of dummy TX periods at fine initialization
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csxInitSwRes;                                   /**< Switch resistance at fine initialization
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csxScanSwRes;                                   /**< Switch resistance at scanning
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csxInitShieldSwRes;                             /**< Switch resistance at fine initialization
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csxScanShieldSwRes;                             /**< Switch resistance at scanning
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csxMfsDividerOffsetF1;                          /**< Frequency divider offset for channel 1. This value is added to
                                                                  * base (channel 0) Tx divider to form channel 1 frequency
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csxMfsDividerOffsetF2;                          /**< Frequency divider offset for channel 2. This value is added to
                                                                  * base (channel 0) Tx divider to form channel 2 frequency
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
    #endif

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        cy_stc_msc_channel_config_t * ptrMscChConfig;           /**< The pointer to the CAPSENSE&trade; enabled MSC channel (HW block) configuration
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */

        DMAC_Type * ptrDmacBase;                                /**< Pointer to the DMAC HW block base register
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        const uint32_t ** ptrDmaWrChSnsCfgAddr;                 /**< Pointer to the array containing the addresses of sensor configurations
                                                                 * used as a source for the DMA Chain Write channel
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        const uint16_t ** ptrDmaRdChSnsCfgAddr;                 /**< Pointer to the array containing the addresses of sensor configurations
                                                                 * used as a source for the DMA Chain Read channel
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */

