RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_structure.h
        uint16_t numEpiCycles;                                  /**< Number of clk_mod cycles to be run during EPILOGUE
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint16_t numCoarseInitChargeCycles;                     /**< Configure duration of Cmod initialization, phase 1
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint16_t numCoarseInitSettleCycles;                     /**< Configure duration of Cmod initialization, phase 2
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint16_t numSlots;                                      /**< Total number of slots
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */

        uint8_t csdShieldMode;                                  /**< Shield mode
                                                                 * * CY_CAPSENSE_SHIELD_DISABLED
                                                                 * * CY_CAPSENSE_SHIELD_ACTIVE
                                                                 * * CY_CAPSENSE_SHIELD_PASSIVE
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t sensorConnection;                                  /**< Sensor Connection. In CS-DMA mode, sensor connection always set to CTRLMUX.
                                                                    * * 0 - CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD:
                                                                    *       All AMUX capable GPIOs available as sensor.
                                                                    * * 1 - CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD:
                                                                    *       Only dedicated GPIO available as sensor.
                                                                    * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                    */
        uint8_t csdCdacAutocalEn;                               /**< CSD CDAC calibration enabled
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t csdRefCdacAutoEn;                               /**< CSD Reference CDAC auto-calibration enabled
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t csdCdacCompEn;                                  /**< CSD Compensation CDAC enabled
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t csdCdacCompDivAutoEn;                           /**< CSD Compensation CDAC divider auto-calibration enabled
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t csdCdacAutoCalibMin;                            /**< Min acceptable CDAC value in CSD auto-calibration
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t csdRefCdacRowColumnAlignEn;                     /**< Row-Column alignment enabled. It adjusts reference CDAC for rows
                                                                 * and for columns in two-dimension CSD widgets to achieve
                                                                 * the similar sensitivity
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t csxCdacAutocalEn;                               /**< CSX CDAC calibration enabled
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t csxRefCdacAutoEn;                               /**< CSX Reference CDAC auto-calibration enabled
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t csxCdacCompEn;                                  /**< CSX Compensation CDAC enabled
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t csxCdacCompDivAutoEn;                           /**< CSX Compensation CDAC divider auto-calibration enabled
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t csxCdacAutoCalibMin;                            /**< Min acceptable CDAC value in CSX auto-calibration
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t csxAutotuneEn;                                  /**< CSX smart sensing algorithm enabled
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t numProOffsetCycles;                             /**< Maximum number of clk_mod cycles for the PRO_OFFSET state.
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t proOffsetCdacComp;                                /**< Compensation CAPDAC size during PRO_OFFSET.
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t scanningMode;                                   /**< Scanning Mode:
                                                                 * * 0 - CY_CAPSENSE_SCAN_MODE_INT_DRIVEN
                                                                 * * 1 - CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t mptxEn;                                         /**< Multi-phase TX enabled
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t chopPolarity;                                   /**< Select polarity for system level chopping
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t cicFilterMode;                                  /**< CIC filter mode
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t numBadScans;                                    /**< 1 to 7, repeat scan upon "bad" scan. Disabled = 0.
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t counterMode;                                    /**< Select overflow or saturate mode for raw count:
                                                                 * * 0 - CY_CAPSENSE_COUNTER_MODE_SATURATE
                                                                 * * 1 - CY_CAPSENSE_COUNTER_MODE_OVERFLOW
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t syncFrameStartEn;                               /**< Enable external synchronization signals
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t syncClockEn;                                    /**< Enable external synchronization signals
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t syncMode;                                       /**< Synchronization mode:
                                                                 * * 0 - CY_CAPSENSE_SYNC_MODE_OFF
                                                                 * * 1 - CY_CAPSENSE_SYNC_EXTERNAL
                                                                 * * 2 - CY_CAPSENSE_SYNC_INTERNAL
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t masterChannelId;                                /**< The ID of the Master channel MULTI-CHIP solution.
                                                                 * This channel will generate msc_ext_frm_start_out
                                                                 * and msc_ext_sync_clk_out signals
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t numChips;                                       /**< The chip number for MULTI-CHIP solution. For SINGLE-CHIP is equal to 1u
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t numChannels;                                    /**< The number of CAPSENSE&trade; enabled MSCv3 blocks in the current chip
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t channelOffset;                                  /**< The ID of the first channel that belongs to the current chip
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    #endif

} cy_stc_capsense_common_config_t;


/** Declares BIST Context Data Structure */
typedef struct
{
    cy_en_capsense_bist_hw_config_t hwConfig;                   /**< A HW configuration for BIST operations */
    cy_en_capsense_bist_io_state_t currentISC;                  /**< The current state of sensors when not being measured during the sensor capacitance measurement */
    cy_en_capsense_bist_io_state_t shieldCapISC;                /**< The configured inactive electrode connection for BIST shield electrode capacitance measurement.
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_SHIELD
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_GROUND */
    cy_en_capsense_bist_io_state_t eltdCapCsdISC;               /**< The configured inactive electrode connection for BIST CSD sensor or electrode capacitance measurement:
                                                                     The states are the same as of the previous parameter */
    cy_en_capsense_bist_io_state_t eltdCapCsxISC;               /**< The configured inactive electrode connection for BIST CSX sensor or electrode capacitance measurement:
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_GROUND */
    cy_en_capsense_bist_io_state_t intrEltdCapShieldISC;        /**< The internal inactive electrode connection used during the BIST shield electrode capacitance measurement:
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_SHIELD
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_GROUND */
    cy_en_capsense_bist_io_state_t intrEltdCapCsdISC;           /**< The internal inactive electrode connection used during the BIST CSD sensor or electrode capacitance measurement:
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_SHIELD
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_GROUND */
    cy_en_capsense_bist_io_state_t intrEltdCapCsxISC;           /**< The internal inactive electrode connection used during the BIST CSX sensor or electrode capacitance measurement:
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_GROUND */
    uint32_t testResultMask;                                    /**< The bit mask of test results (PASS/FAIL) */
#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
    uint32_t shieldCap;                                         /**< The shield capacitance measurement result in femtofarads
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
#endif

#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
    uint32_t * ptrChShieldCap;                                  /**< The pointer to the channel shield capacitance measurement result array
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
#endif

    uint32_t eltdCapSnsClkFreqHz;                               /**< The value of the SnsClk frequency is Hz */
    uint16_t * ptrWdgtCrc;                                      /**< The pointer to the widget CRC array */

