RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_structure.h
    uint16_t wdgtCrcCalc;                                       /**< A calculated by test CRC for a widget context structure */

    uint16_t eltdCapModClk;                                     /**< The ModClk divider for electrode capacitance measurement scans */
    uint16_t eltdCapSnsClk;                                     /**< The SnsClk divider for electrode capacitance measurement scans */

    uint8_t eltdCapSenseGroup;                                  /**< The sensor group for capacitance measurement:
                                                                    * * 0 - UNDEFINED   (CY_CAPSENSE_UNDEFINED_GROUP)
                                                                    * * 1 - CSD         (CY_CAPSENSE_CSD_GROUP)
                                                                    * * 2 - CSX         (CY_CAPSENSE_CSX_GROUP) */
    uint8_t crcWdgtId;                                          /**< The first CRC failed widget ID */
    uint8_t snsIntgShortSettlingTime;                           /**< The sensor and shield short check time in microseconds */
    uint8_t shortedWdId;                                        /**< The first shorted to GND/VDDA/ELTD widget ID */
    uint8_t shortedSnsId;                                       /**< The first shorted to GND/VDDA/ELTD sensor ID */

#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
    uint32_t regSwHsPSelScan;                                   /**< Internal pre-calculated data for faster operation */
    uint32_t regSwHsPSelCmodInit;                               /**< Internal pre-calculated data for faster operation */
    uint32_t regSwHsPSelCtankInit;                              /**< Internal pre-calculated data for faster operation */
    uint32_t regSwDsiSel;                                       /**< Internal pre-calculated data for faster operation */
    uint32_t regSwShieldSelScan;                                /**< Internal pre-calculated data for faster operation */
    uint32_t regSwResInit;                                      /**< Internal pre-calculated data for faster operation */
    uint32_t regSwResScan;                                      /**< Internal pre-calculated data for faster operation */
    uint32_t regSwBypSel;                                       /**< Internal pre-calculated data for faster operation */
    uint32_t regSwAmuxbufSel;                                   /**< Internal pre-calculated data for faster operation */
    uint32_t regAmbuf;                                          /**< Internal pre-calculated data for faster operation */
    uint32_t regHscmpScan;                                      /**< Internal pre-calculated data for faster operation */
    uint32_t regSwRefgenSel;                                    /**< Internal pre-calculated data for faster operation */
    uint32_t regConfig;                                         /**< Internal pre-calculated data for faster operation */
    uint32_t regIoSel;                                          /**< Internal pre-calculated data for faster operation */
    uint32_t regAmbufShield;                                    /**< Internal pre-calculated data for faster operation */
    uint32_t regHscmpScanShield;                                /**< Internal pre-calculated data for faster operation */
    uint32_t regSwShieldSelScanShield;                          /**< Internal pre-calculated data for faster operation */
    uint32_t regSwHsPSelScanShield;                             /**< Internal pre-calculated data for faster operation */
    uint32_t regSwBypSelShield;                                 /**< Internal pre-calculated data for faster operation */
    uint32_t regSwAmuxbufSelShield;                             /**< Internal pre-calculated data for faster operation */
    uint32_t regConfigShield;                                   /**< Internal pre-calculated data for faster operation */
    uint32_t regIoSelShield;                                    /**< Internal pre-calculated data for faster operation */

    uint32_t extCapIdacPa;                                      /**< The IDAC value in pA for external capacitor capacity measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t extCapModClk;                                      /**< The ModClk divider for external capacitor capacity measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t extCapSnsClk;                                      /**< The SnsClk divider for external capacitor capacity measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t extCapWDT;                                         /**< The SW watchdog timeout used to prevent a hang in case of short
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t extCapVrefMv;                                      /**< The Vref value in mV for external capacitor capacity measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t cModCap;                                           /**< The Cmod capacitance measurement result in picofarads
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t cIntACap;                                          /**< The CintA capacitance measurement result in picofarads
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t cIntBCap;                                          /**< The CIntB capacitance measurement result in picofarads
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t cShieldCap;                                        /**< The Cshield capacitance measurement result in picofarads
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t capacitorSettlingTime;                             /**< The maximum possible external capacitor charge/discharge time in microseconds
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t vddaVoltage;                                       /**< The result of VDDA measurement in millivolts
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t vddaModClk;                                        /**< The ModClk divider for VDDA measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t vddaVrefMv;                                        /**< The Vref value in mV for VDDA measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t eltdCapVrefMv;                                     /**< The Vref value in mV for electrode capacitance measurement scans
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t eltdCapResolution;                                 /**< The resolution for electrode capacitance measurement scans
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */

    uint8_t vddaIdacDefault;                                    /**< The IDAC default code for Vdda measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t vddaAzCycles;                                       /**< The auto-zero time in Sns cycles for Vdda measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t vddaAcqCycles;                                      /**< The acquisition time in Sns cycles - 1 for Vdda measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t fineInitTime;                                       /**< Number of dummy SnsClk periods at fine initialization for BIST scans
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t eltdCapVrefGain;                                    /**< The Vref gain for electrode capacitance measurement scans
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t vddaVrefGain;                                       /**< The Vref gain for VDDA measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t extCapVrefGain;                                     /**< The Vref gain for external capacitor capacitance measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
#endif

#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
    const cy_stc_capsense_electrode_config_t * curPtrEltdCfg;   /**< The pointer to the current electrode configuration for BIST operations
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    uint32_t eltdInactiveDm;                                    /**< Internal pre-calculated data for faster operation */
    en_hsiom_sel_t eltdInactiveHsiom;                           /**< Internal pre-calculated data for faster operation */

    uint16_t curBistSlotId;                                     /**< The current slot ID for BIST operations
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t eltdCapSubConvNum;                                  /**< The sub-conversion number for electrode capacitance measurement scans
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t eltdCapNumEpiCycles;                               /**< Number of clk_mod cycles to be run during EPILOGUE
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t eltdCapNumCoarseInitChargeCycles;                  /**< Configure duration of Cmod initialization, phase 1
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t eltdCapNumCoarseInitSettleCycles;                  /**< Configure duration of Cmod initialization, phase 2
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t eltdCapNumFineInitWaitCycles;                         /**< Number of ProDummy Wait Cycles
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t eltdCapNumFineInitCycles;                           /**< Number of ProDummy SubConversions
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t eltdCapRefCdac;                                     /**< The reference CDAC code for electrode capacitance measurement scans
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t curBistChId;                                        /**< The current MSCv3 channel ID for BIST operations
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t skipChannelMask;                                    /**< The skip channel mask for BIST operations
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t eltdCapScanMode;                                    /**< The scan mode for sensor (electrode) capacitance measurement
                                                                 * * 0u - scan by slots (CY_CAPSENSE_BIST_CAP_SLOT_SCAN)
                                                                 * * 1u - scan by electrodes (CY_CAPSENSE_BIST_CAP_ELTD_SCAN)
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
#endif
}
cy_stc_capsense_bist_context_t;


#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
/** Declares the BIST structure with custom scan parameters
 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
 */
typedef struct
{
    uint16_t modClk;                                            /**< The ModClk divider for a custom scan. The minimum value is 1 and the maximum depends on a divider type,
                                                                     but for a reliable CSD HW block operation, it is recommended to provide
                                                                     a modulation clock frequency in the range from 1 to 50 MHz */
    uint16_t snsClk;                                            /**< The SnsClk divider for a custom scan. The minimum value is 4 and the maximum is 4095,
                                                                     but for a reliable CSD HW block operation, it is recommended to provide
                                                                     an sensor clock frequency in the range from 100 to 6000 kHz */
    uint16_t convNum;                                           /**< The number of conversions for a custom scan. The maximum raw counts is equal (convNum * snsClkDivider - 1),
                                                                     that corresponds to (2^Resolution - 1) in older notations. The minimum value is 4 and the maximum is 65535,
                                                                     but as the maximum raw counts is 65535, the convNum value should be less than (65536 / snsClkDivider) */
    cy_en_capsense_bist_io_state_t customISC;                   /**< The inactive state of sensors during the custom scan */
    uint8_t reserved0;                                          /**< Reserved field */

    uint8_t vrefGain;                                           /**< The Vref gain for a custom scan */
    uint8_t idacMod;                                            /**< Sets the code of the modulation IDAC for a custom scan */
    uint8_t idacGainIndex;                                      /**< Index of IDAC gain in table \ref cy_stc_capsense_idac_gain_table_t */
    uint8_t fineInitTime;                                       /**< Number of dummy SnsClk periods at fine initialization for a custom scan */

}cy_stc_capsense_bist_custom_parameters_t;
#endif


