RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_structure.h
/** Declares active sensor details */
typedef struct
{
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        const cy_stc_capsense_widget_config_t * ptrWdConfig;    /**< Pointer to the widget configuration structure of the active sensor */
        cy_stc_capsense_widget_context_t * ptrWdContext;        /**< Pointer to the widget context structure of the active sensor */
        uint8_t scanScope;                                      /**< Keeps request of scanning either:
                                                                   * * CY_CAPSENSE_SCAN_SCOPE_SNGL_SNS - Single sensor
                                                                   * * CY_CAPSENSE_SCAN_SCOPE_ALL_SNS_MASK - All sensors of one widget
                                                                   * * CY_CAPSENSE_SCAN_SCOPE_ALL_WD_MASK - All widgets */
        uint8_t mfsChannelIndex;                                /**< MFS channel index
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t rxIndex;                                        /**< Current Rx ID */
        uint8_t txIndex;                                        /**< Current Tx ID */
    #endif

    const cy_stc_capsense_electrode_config_t * ptrEltdConfig;   /**< Pointer to the electrode configuration structure of the active sensor */
    const cy_stc_capsense_electrode_config_t * ptrRxConfig;     /**< Pointer to the Rx electrode configuration structure of the active sensor */
    const cy_stc_capsense_electrode_config_t * ptrTxConfig;     /**< Pointer to the Tx electrode configuration structure of the active sensor */

    cy_stc_capsense_sensor_context_t * ptrSnsContext;           /**< Pointer to the sensor context structure */

    uint16_t currentChannelSlotIndex;                           /**< Current slot Index for channel */
    uint16_t sensorIndex;                                       /**< Current sensor ID */
    uint8_t widgetIndex;                                        /**< Current widget ID */
    uint8_t currentSenseMethod;                                 /**< Current sensing method */
    uint8_t connectedSnsState;                                  /**< Shows if the current sensor is connected to analog bus */
} cy_stc_active_scan_sns_t;


/**
* Provides the typedef for the callback function that is intended to be called when
* the \ref cy_en_capsense_callback_event_t events occurs.
*/
typedef void (*cy_capsense_callback_t)(cy_stc_active_scan_sns_t * ptrActiveScan);

#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
    /**
    * Provides the typedef for the callback function that is called by the
    * Cy_CapSense_Enable() function to change the CAPSENSE&trade; configuration from
    * the default configuration to the user's specific use cases.
    * Refer to \ref group_capsense_callbacks section.
    *
    * \note This callback function is available only for the fifth-generation CAPSENSE&trade;.
    */
    typedef void (*cy_capsense_ds_init_callback_t)(void * context);
#endif

/**
* Provides the typedef for the callback function that is called by the
* Cy_CapSense_RunTuner() function to establish communication with
* the CAPSENSE&trade; Tuner tool to monitor CAPSENSE&trade; operation.
* Refer to \ref group_capsense_callbacks section.
*/
typedef void (*cy_capsense_tuner_send_callback_t)(void * context);

/**
* Provides the typedef for the callback function that is called by the
* Cy_CapSense_RunTuner() function to establish communication with
* the CAPSENSE&trade; Tuner tool to support life-time tuning.
* Refer to \ref group_capsense_callbacks section.
*/
typedef void (*cy_capsense_tuner_receive_callback_t)(uint8_t ** commandPacket, uint8_t ** tunerPacket, void * context);


/** Declares internal Context Data Structure */
typedef struct
{
    uint8_t intrCsdInactSnsConn;                                /**< Internal inactive electrode connection for CSD scan:
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_SHIELD
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_GROUND */
    uint8_t intrCsxInactSnsConn;                                /**< Internal inactive electrode connection for CSX scan:
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_GROUND */
    uint32_t csdInactiveSnsDm;                                  /**< Internal pre-calculated data for faster operation */
    en_hsiom_sel_t csdInactiveSnsHsiom;                         /**< Internal pre-calculated data for faster operation */

    uint32_t csxInactiveSnsDm;                                  /**< Internal pre-calculated data for faster operation */
    en_hsiom_sel_t csxInactiveSnsHsiom;                         /**< Internal pre-calculated data for faster operation */

    cy_capsense_callback_t ptrSSCallback;                           /**< Pointer to a user's Start Sample callback function. Refer to \ref group_capsense_callbacks section */
    cy_capsense_callback_t ptrEOSCallback;                          /**< Pointer to a user's End Of Scan callback function. Refer to \ref group_capsense_callbacks section */
    cy_capsense_tuner_send_callback_t ptrTunerSendCallback;         /**< Pointer to a user's tuner callback function. Refer to \ref group_capsense_callbacks section */
    cy_capsense_tuner_receive_callback_t ptrTunerReceiveCallback;   /**< Pointer to a user's tuner callback function. Refer to \ref group_capsense_callbacks section */

    void (* ptrISRCallback)(void * context);                        /**< Pointer to the scan interrupt handler */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint32_t csdRegConfig;                                  /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csdRegSwHsPSelScan;                            /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csdRegSwHsPSelCmodInit;                        /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csdRegSwHsPSelCtankInit;                       /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csdRegSwBypSel;                                /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csdRegSwResScan;                               /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csdRegSwResInit;                               /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csdRegSwDsiSel;                                /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csdRegAmuxbufInit;                             /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csdRegSwAmuxbufSel;                            /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csdRegSwShieldSelScan;                         /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csdRegHscmpInit;                               /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csdRegHscmpScan;                               /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csdIdacAConfig;                                /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csdIdacBConfig;                                /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csdRegSwCmpPSel;                               /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csdRegSwCmpNSel;                               /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csdRegIoSel;                                   /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csdRegRefgen;                                  /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csdRegSwRefGenSel;                             /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */

        uint32_t csxRegConfigInit;                              /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csxRegConfigScan;                              /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csxRegSwResInit;                               /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csxRegSwResPrech;                              /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csxRegSwResScan;                               /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csxRegAMuxBuf;                                 /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csxRegRefgen;                                  /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csxRegRefgenSel;                               /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csxRegSwCmpNSel;                               /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint32_t csxRegSwRefGenSel;                             /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */

        uint8_t csdCmodConnection;                              /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csdCshConnection;                               /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csdVrefGain;                                    /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint16_t csdVrefVoltageMv;                              /**< Internal pre-calculated data for faster operation
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
    #endif

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        cy_capsense_ds_init_callback_t ptrEODsInitCallback;     /**< Pointer to a user's End Of Data Structure Initialization callback function. Refer to \ref group_capsense_callbacks section
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint32_t snsCtlReg[CY_CAPSENSE_TOTAL_CH_NUMBER];        /**< Keeps value of non-retention SNS_CTL register for LFT mode */
        uint16_t numEpiCycles;                                  /**< Number of clk_mod cycles to be run during EPILOGUE
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint16_t numCoarseInitChargeCycles;                     /**< Configure duration of Cmod initialization, phase 1
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint16_t numCoarseInitSettleCycles;                     /**< Configure duration of Cmod initialization, phase 2
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint16_t numFineInitWaitCycles;                         /**< Number of ProDummy Wait Cycles
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint16_t currentSlotIndex;                              /**< Current slot ID
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint16_t endSlotIndex;                                  /**< The last slot ID for the current frame
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t scanSingleSlot;                                 /**< Request of scanning just one slot with keeping HW configuration after scan:
                                                                 * * CY_CAPSENSE_SCAN_SNGL_SLOT - Single slot scanning
                                                                 * * CY_CAPSENSE_SCAN_MULTIPLE_SLOT - Multiple slot scanning
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t numSenseMethod;                                 /**< The number of sense methods, used in the project
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t mapSenseMethod[CY_CAPSENSE_REG_MODE_NUMBER];    /**< The map array of sense methods, used in the project
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t numProOffsetCycles;                             /**< Maximum number of clk_mod cycles for the PRO_OFFSET state.
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t proOffsetCdacComp;                              /**< Compensation CAPDAC size during PRO_OFFSET.
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t hwConfigState;                                  /**< Contains the current hw state, it is configured or not and if yes then to what operation
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t slotAutoCalibrMode;                             /**< The slot auto-calibration mode:
                                                                 * * 0 - CY_CAPSENSE_CAL_MODE_REF_CDAC_SUC_APPR
                                                                 * * 2 - CY_CAPSENSE_CAL_MODE_COMP_CDAC_SUC_APPR
                                                                 * * 3 - CY_CAPSENSE_CAL_MODE_COMP_CDAC_MAX_CODE
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t intrCsdRawTarget;                               /**< Internal auto-calibration target in percentage for CSD widgets
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t intrCsxRawTarget;                               /**< Internal auto-calibration target in percentage for CSX widgets
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    #endif

}cy_stc_capsense_internal_context_t;


