RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_structure.h
/** Declares the structure that is intended to store the \ref cy_stc_capsense_widget_context_t
 *  data structure fields, the CRC checking should be applied for.
 * \note This structure is available only for the fourth-generation CAPSENSE&trade;.
 */
typedef struct
{
    uint16_t fingerThVal;                                       /**< The value of the .fingerTh field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t proxThVal;                                         /**< The value of the .proxTh field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t fingerCapVal;                                      /**< The value of the .fingerCap field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t sigPFCVal;                                         /**< The value of the .sigPFC field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t resolutionVal;                                     /**< The value of the .resolution field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t lowBslnRstVal;                                     /**< The value of the .lowBslnRst field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t snsClkVal;                                         /**< The value of the .snsClk field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t rowSnsClkVal;                                      /**< The value of the .rowSnsClk field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t  noiseThVal;                                       /**< The value of the .noiseTh field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t  nNoiseThVal;                                      /**< The value of the .nNoiseTh field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t  hysteresisVal;                                    /**< The value of the .hysteresis field of the \ref cy_stc_capsense_widget_context_t structure */
    uint8_t  onDebounceVal;                                     /**< The value of the .onDebounce field of the \ref cy_stc_capsense_widget_context_t structure */
    uint8_t  snsClkSourceVal;                                   /**< The value of the .snsClkSource  field of the \ref cy_stc_capsense_widget_context_t structure */

#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
    uint8_t  idacModVal[CY_CAPSENSE_MAX_SUPPORTED_FREQ_NUM];    /**< The value of the .idacMod field of the \ref cy_stc_capsense_widget_context_t structure
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t  idacGainIndexVal;                                  /**< The value of the .idacGainIndex field of the \ref cy_stc_capsense_widget_context_t structure
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t  rowIdacModVal[CY_CAPSENSE_MAX_SUPPORTED_FREQ_NUM]; /**< The value of the .rowIdacMod field of the \ref cy_stc_capsense_widget_context_t structure
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
#endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */

#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
    uint16_t cdacCompDivider;                                   /**< The value of the .cdacCompDivider field of the \ref cy_stc_capsense_widget_context_t structure
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t cdacRef;                                            /**< The value of the .cdacRef field of the \ref cy_stc_capsense_widget_context_t structure
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t rowCdacRef;                                         /**< The value of the .rowCdacRef field of the \ref cy_stc_capsense_widget_context_t structure
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t cicRate;                                            /**< The value of the .cicRate field of the \ref cy_stc_capsense_widget_context_t structure
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t lfsrBits;                                           /**< The value of the .lfsrBits field of the \ref cy_stc_capsense_widget_context_t structure
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
#endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */
}cy_stc_capsense_widget_crc_data_t;
/** \} */


/******************************************************************************/
/** \addtogroup group_capsense_structures *//** \{ */
/******************************************************************************/

/** Declares top-level Context Data Structure */
typedef struct
{
    uint16_t configId;                                          /**< 16-bit CRC calculated by the CAPSENSE&trade; Configurator tool for the CAPSENSE&trade; configuration.
                                                                   * Used by the CAPSENSE&trade; Tuner tool to identify if the FW corresponds to the specific user configuration. */
    uint16_t tunerCmd;                                          /**< Tuner Command Register \ref cy_en_capsense_tuner_cmd_t.
                                                                   * Used for the communication between the CAPSENSE&trade; Tuner tool and the middleware */
    uint16_t scanCounter;                                       /**< This counter increments after each scan. */
    uint8_t tunerSt;                                            /**< State of CAPSENSE&trade; middleware tuner module. \ref cy_en_capsense_tuner_state_t */
    uint8_t initDone;                                           /**< Keep information whether initialization was done or not */
    volatile uint32_t status;                                   /**< Middleware status information, scan in progress (1) or not (0).
                                                                   * For MSCv3 each bit shows the correspondent channel status */
    uint32_t timestampInterval;                                 /**< Timestamp interval used at increasing the timestamp by Cy_CapSense_IncrementGestureTimestamp() */
    uint32_t timestamp;                                         /**< Current timestamp should be kept updated and operational, which is vital for the
                                                                   * operation of Gesture and Ballistic multiplier features */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint8_t modCsdClk;                                      /**< The modulator clock divider for the CSD widgets
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t modCsxClk;                                      /**< The modulator clock divider for the CSX widgets
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    #endif

    uint8_t tunerCnt;                                           /**< Command counter of CAPSENSE&trade; middleware tuner module */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        uint8_t numFineInitCycles;                              /**< Number of ProDummy SubConversions
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint16_t numFineInitWaitCycles;                         /**< Number of ProDummy Wait Cycles
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint16_t lfsrPoly;                                      /**< LFSR Polynomial
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t lfsrScale;                                      /**< LFSR Scale value
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t cdacDitherSeed;                                 /**< Dither CDAC Seed
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t cdacDitherPoly;                                 /**< Dither CDAC Polynomial
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t modClk;                                         /**< The modulator clock divider
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    #endif
} cy_stc_capsense_common_context_t;


/** Declares top-level CAPSENSE&trade; context data structure */
typedef struct
{
    const cy_stc_capsense_common_config_t * ptrCommonConfig;    /**< Pointer to the common configuration structure */
    cy_stc_capsense_common_context_t * ptrCommonContext;        /**< Pointer to the common context structure */
    cy_stc_capsense_internal_context_t * ptrInternalContext;    /**< Pointer to the internal context structure */
    const cy_stc_capsense_widget_config_t * ptrWdConfig;        /**< Pointer to the widget configuration structure */
    cy_stc_capsense_widget_context_t * ptrWdContext;            /**< Pointer to the widget context structure */
    const cy_stc_capsense_pin_config_t * ptrPinConfig;          /**< Pointer to the pin configuration structure */
    const cy_stc_capsense_pin_config_t * ptrShieldPinConfig;    /**< Pointer to the shield pin configuration structure */
    cy_stc_active_scan_sns_t * ptrActiveScanSns;                /**< Pointer to the current active sensor structure */
    cy_stc_capsense_bist_context_t * ptrBistContext;            /**< Pointer to the BIST context structure */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        cy_stc_msc_base_config_t * ptrBaseFrameContext;         /**< Pointer to the first member of the context structure of base configuration array
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint32_t * ptrSensorFrameContext;                       /**< Pointer to the context structure of sensor configuration
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        const cy_stc_capsense_scan_slot_t * ptrScanSlots;       /**< Pointer to the scan order slot structure
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    #endif
} cy_stc_capsense_context_t;

